{
  "nav": {
    "home": "Главная",
    "about": "Обо мне",
    "skills": "Навыки",
    "projects": "Проекты",
    "contact": "Контакты"
  },

  "home": {
    "title": "Веб-портфолио 2025",
    "subtitle": "Фронтенд-разработка с React и Chakra UI"
  },

  "presentation": {
    "title": "Обо мне",
    "paragraph1": "Меня зовут <strong>Наталия Швиндт</strong>. Я фронтенд-разработчик, специализирующаяся на React и Chakra UI. Я сосредоточена на создании чистых, адаптивных и доступных цифровых продуктов.",
    "paragraph2": "Я стремлюсь сочетать привлекательный дизайн с функциональным кодом, постоянно изучая новые инструменты и технологии для профессионального роста."
  },

  "skills": {
    "title": "Технологии и технические навыки",
    "categories": {
      "Frontend": "Фронтенд",
      "Backend": "Бэкенд",
      "Herramientas": "Инструменты"
    },
    "softSkillsTitle": "Гибкие навыки",
    "softSkills": [
      "Коммуникация",
      "Работа в команде",
      "Решение проблем",
      "Критическое мышление",
      "Адаптивность",
      "Управление временем",
      "Креативность",
      "Эмпатия",
      "Лидерство"
    ]
  },

  "projectsTitle": "Мои проекты",
  "seeMore": "Подробнее →",
  "projects": [
    {
      "title": "Итоговый проект интернет-магазина на React",
      "description": "Приложение интернет-магазина, разработанное на React, имитирует процесс покупки товаров. Позволяет просматривать базу данных товаров, фильтровать по цене, искать по названию, добавлять в избранное и управлять интерактивной корзиной. Симулирует финальную покупку с визуальным подтверждением. Использует Firebase в качестве имитации backend. Интерфейс построен с использованием Chakra UI, адаптирован для разных устройств. Включает навигацию с React Router, формы на react-hook-form и анимации с framer-motion."
    },
    {
      "title": "Список задач",
      "description": "Приложение, созданное как итоговый проект модуля V в ADA ITW. Позволяет создавать и управлять списками задач динамично и удобно. Пользователь может добавлять задачи, редактировать их, фильтровать по статусу (выполненные или нет) и удалять по мере необходимости. Интерфейс построен с React и Chakra UI для комфортной работы с любого устройства. Проект использует Vite для быстрого и эффективного окружения разработки."
    },
    {
      "title": "Поиск комиксов",
      "description": "Веб-приложение для поиска, фильтрации и сортировки комиксов и персонажей Marvel с использованием официального API. Имеет постраничную навигацию и отображает результаты в адаптивных карточках с изображениями и основной информацией. Разработано на HTML, Tailwind CSS и чистом JavaScript."
    },
    {
      "title": "AhorrADAs",
      "description": "Веб-приложение, разработанное в команде с другой студенткой в рамках совместного проекта. Предназначено для управления личными финансами. Позволяет регистрировать доходы и расходы, фильтровать по типу, категории или дате и просматривать персонализированные отчёты. Реализовано на JavaScript, Tailwind CSS и LocalStorage. Включает полную русскую версию, чтобы расширить охват аудитории."
    },
    {
      "title": "Редактор мемов",
      "description": "Редактор мемов, разработанный индивидуально на HTML, CSS и JavaScript. Позволяет добавлять текст сверху и снизу изображения с множеством опций настройки: шрифт, размер, выравнивание, цвет, обводка, отступы и межстрочный интервал. Включает фильтры (яркость, контраст, прозрачность, размытие и другие) и возможность скачать финальный мем в виде изображения. Основное внимание в проекте уделено манипуляции DOM, динамическим стилям и удобству визуального редактирования."
    },
    {
      "title": "QR-проект",
      "description": "Проект веб-дизайна, имитирующий цифровое меню ресторана. Разработан с использованием только HTML и CSS. Изображения созданы с помощью ИИ (Leonardo AI), что обеспечило уникальный и цельный визуальный стиль. Сайт содержит разделы с напитками, едой и десертами с креативными описаниями, подчёркивающими идентичность ресторана. Включает QR-код для быстрого доступа с мобильных устройств. Это был один из самых любимых проектов благодаря сочетанию дизайна, повествования и креативности."
    }
  ],

  "contact": {
    "title": "Контакты",
    "text": "Хотите сотрудничать со мной, есть вопросы или просто хотите узнать больше о моей работе? Я здесь, чтобы помочь и с радостью свяжусь с вами. Не стесняйтесь писать; я всегда с удовольствием отвечаю и готова обсудить новые возможности. Буду рада получить ваше сообщение!"
  },

  "footer": {
    "createdBy": "Создано Наталией Швиндт © 2025"
  }
}
