{
  "nav": {
    "home": "Главная",
    "about": "Обо мне",
    "skills": "Навыки",
    "projects": "Проекты",
    "contact": "Контакты"
  },

  "home": {
    "title": "Наталья Швиндт",
    "subtitle": "Фронтенд-разработка с использованием React и Chakra UI"
  },

  "presentation": {
    "title": "Обо мне",
    "paragraph1": "Меня зовут <strong>Наталья Швиндт</strong>. Я фронтенд-разработчик, специализирующаяся на React и Chakra UI. Я сосредоточена на создании чистых, адаптивных и доступных цифровых продуктов.",
    "paragraph2": "Я стремлюсь сочетать привлекательный дизайн с функциональным кодом, постоянно изучая новые инструменты и технологии для профессионального роста."
  },

  "skills": {
    "title": "Технологии и технические навыки",
    "categories": {
      "Frontend": "Фронтенд",
      "Backend": "Бэкенд",
      "Herramientas": "Инструменты"
    },
    "softSkillsTitle": "Гибкие навыки",
    "softSkills": [
      "Коммуникация",
      "Работа в команде",
      "Решение проблем",
      "Критическое мышление",
      "Адаптивность",
      "Управление временем",
      "Креативность",
      "Эмпатия",
      "Лидерство"
    ]
  },

  "projectsTitle": "Мои проекты",
  "seeMore": "Подробнее →",
  "projects": [
    {
      "title": "Итоговый проект интернет-магазина на React",
      "description": "Приложение для электронной коммерции, разработанное с использованием React. Проект имитирует процесс покупки товаров, позволяет просматривать базу данных товаров, применять фильтры по цене, осуществлять поиск по названию, добавлять закладки и управлять интерактивной корзиной покупок. Также можно показать окончательную покупку (имитация) при подтверждении пользователя. В качестве бэкэнда используется Firebase, интерфейс разработан с использованием Chakra, что обеспечивает адаптивность с учётом доступности для отдельных категорий пользователей. Приложение включает динамическую навигацию с помощью React Router, формы, оптимизированные с помощью react-hook-form, а также плавную анимацию с использованием framer-motion."
    },
    {
      "title": "Список задач",
      "description": "Приложение разработано как окончательный проект модуля V ADA ITW. Позволяет создавать списки задач с динамическим интуитивным управлением. Пользователь может добавлять задачи, редактировать их, фильтровать по статусу (ожидающие выполнения или завершённые) и удалять их по мере необходимости. Дизайн был выполнен с использованием React и Chakra UI, что обеспечивает удобство использования с любого устройства. Это практичный инструмент, предназначенный для улучшения личной или рабочей организованности. Проект использует Vite для быстрой и эффективной разработки."
    },
    {
      "title": "Поиск комиксов",
      "description": "Веб-приложение, позволяющее искать, фильтровать и сортировать комиксы и персонажей Marvel с помощью их официального API. Имеется разбивку на страницы и отображение результатов на адаптивных карточках с изображениями и основными деталями. Разработано с использованием HTML, Tailwind CSS и чистого JavaScript."
    },
    {
      "title": "СберегАДА",
      "description": "Веб-приложение, разработанное в команде с другой студенткой в рамках совместной практики. Ориентировано на управление личными финансами и позволяет регистрировать доходы и расходы, применять фильтры по типу, категории или дате. Также в наличии есть настраиваемые отчёты. Проект выполнен с использованием обычного JavaScript, Tailwind CSS и localStorage. Дополнительно проект включает в себя полностью переведённый на русский язык интерфейс, предназначенный для расширения аудитории пользователей."
    },
    {
      "title": "Редактор мемов",
      "description": "Редактор мемов с использованием HTML, CSS и обычного JavaScript. Приложение позволяет настраивать изображения, добавляя верхний и нижний текст с несколькими вариантами настроек: шрифт, размер, выравнивание, цвет, контур, интервал и междустрочный интервал. Он также включает в себя инструменты для изменения внешнего вида изображения с помощью фильтров (яркость, контрастность, непрозрачность, размытие и другие) и возможность загрузки окончательного мема в формате изображения. Проект был сосредоточен на практике манипулирования DOM, динамических стилях и удобстве использования при визуальном редактировании."
    },
    {
      "title": "QR-проект",
      "description": "Проект веб-дизайна, имитирующий меню ресторана. Разработан с использованием чистого HTML и CSS. Изображения были созданы с использованием искусственного интеллекта (Leonardo AI), что позволило создать оригинальный и единый визуальный стиль. На сайте представлены доступные для просмотра разделы напитков, блюд и десертов, сопровождаемые креативными описаниями, подчёркивающими индивидуальность ресторана. Всё это дополняется QR-кодом, позволяющим легко получить доступ к меню с мобильных устройств, имитируя его использование в реальной среде. Этот проект был одним из самых популярных благодаря сочетанию дизайна, описания и визуального творчества."
    }
  ],

  "contact": {
    "title": "Контакты",
    "text": "Хотите сотрудничать со мной, есть вопросы или просто хотите узнать больше о моей работе? Я здесь, чтобы помочь и с радостью свяжусь с вами. Не стесняйтесь писать; я всегда с удовольствием отвечаю и готова обсудить новые возможности. Буду рада получить ваше сообщение!"
  },

  "footer": {
     "createdBy": "Создано Натальей Швиндт © 2025"
  }
}
